<!--**************************************************-->
<!--JSP 페이지 처리 방식 선언-->
<!--**************************************************-->
<%@page contentType = "text/html;charset=UTF-8" pageEncoding = "UTF-8"%>
<!--**************************************************-->
<!--현재 페이지에 common.jsp 파일 내의 소스 삽입-->
<!--**************************************************-->
<%@include file="common1.jsp"%>

<!--**************************************************-->
<!--[연락처 등록 행의 개수]를 EL로 출력-->
<!--**************************************************-->
<html>
<body>

<hr><b>[ContactController 클래스]의 @RequestMapping 이 붙은 메소드 호출 시 에러발생!<hr>


${info}


</body>
</html>
