#include<cstdio>


int main() {

	int n;
	scanf("%d", &n);


	//줄수 0 1 2 3 4 5 6 7 8 9 10 11 12 13 14까지가능 하지만 입력수는 1이상부터 
	//n은 동수 1부터 14까지 
	//(n-1)  -B동에 있는 전부를 데려고오고 살아야함 
	// (n-1) (n)
     
	//1 5 15 35	70												  규칙성 발견 DP[x][y] = x-1 +y-1                                
	//1 4 10 20 35  56  84   120  165  220   286   364 455  560   규칙성은 공차가 1씩 증가하는 수열    n(a+l)/2                                  
	
	//1 3 6  10 15  21  28   36   45   55     66   78   91  105  1은 1부터 n까지의합  n(a+l)/2
	//1 2 3 4   5  6   7    8    9   10     11   12   13  14

	for (int i = 0; i < n; i++)
	{
		int k = 0;
		int N2 = 0;
		int DP[15][15] = { 0, };
		for (int i = 1; i <= 14; i++) {
			DP[0][i] = i;
		}

		scanf("%d %d",&k,&N2);
		for (int i = 1; i <= k; i++) {
			for (int j = 1; j <= N2; j++) {
				DP[i][j] = DP[i][j-1]+DP[i-1][j];
			}
		}
		printf("%d\n", DP[k][N2]);



	}



}